export type BlogPost = {
  slug: string;
  title: string;
  category: string;
  date: string;
  thumbnail: string;
  description: string;
  seoDescription?: string;
  tags: string[];
  content: string;
};

export const posts = [
  {
    slug: "portfolio-renewal",
    title: "ポートフォリオを1から作り直した話",
    category: "Next.js",
    date: "2026-09-30",
    thumbnail: "/images/blog/default-cover.webp",
    description:
      "ポートフォリオサイトを作り直し、すべての活動を統合した話",
    seoDescription:
      "Next.jsとTailwind CSSを使ってポートフォリオサイトを1から作り直した話。",
    tags: ["Next.js", "Tailwind", "Portfolio"],
    content: `　↑画像がない場合に置こうと思って生成した画像。可愛すぎたのでこのまま置いとこ(´▽｀*)
    

    　ポートフォリオにAIイラストやツール紹介を導入するにあたって、すべてを作り直すことにしました。
    
    　昔作るだけ作ったまま放置していたブログサイトを引っ張り出し、軽くリメイクして使うつもりが結局オーバーホールすることになった(;´Д｀)
    でもそのおかげでほどほどに満足な拠点サイトを作ることができた！
    
    　ちなみにまだマークダウン対応ができてないのでただつらつらと記録しています(;・∀・)
    次のアップデートはまずそれかな。
    
    
    　ブログページを作ったけどもそこまでがちがちに書くつもりはなくて、勉強した内容とかAIイラストのこととか記録したほうが財産になるかなってことで始めました。
    口調が安定しないのう( ;∀;)
    
    　まだ追加したい機能もあるし、バグもあると思うのでとりあえず様子見しながらアップデートを重ねていく予定。
    せっかく見てくれる人が増えてきたのでご意見箱とか設置しようかな。
    
    
    　少し技術的な話をすると、このサイトはNext.jsとTailwindというフレームワークを使用して作成しています。
    こんなにWebをがっつり触ったのは久しぶりだあ(-_-)
    
    　とはいえサーバーサイドはまだ構築しておらず、現状はフロントだけで作った静的サイトってことになります。
    静的で性的なサイトだよ( ^^) _旦~~
    
    　バックエンドの経験が浅いのでまた勉強しながらやっていこうと思います！
    
    
    　初回にがっつり書いてもまだ見づらいし、今回はこのあたりで。
    AIイラストやプロジェクトをガンガン投稿していくので、良ければ見ていってください！
    
    ではまた(^^)/`
  },
];
